In [77]:
import pandas as pd
pd.__version__

'0.22.0'

In [ ]:
df = pd.read_csv('/Users/palanisamy/Documents/100DaysOfML/titanic.csv')

In [ ]:
df.head()

In [55]:
df.shape

(891, 12)

In [ ]:
df.dtypes

In [ ]:
# Find all the columns with null values from dataset
#print(df.columns[df.isnull().any()])
df.isnull().any()

In [56]:
#find out the total missing values of each variable.
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [57]:
#ReCheck total missing values of Age
#we can check the subset of the dataset 
df[df['Age'].isnull()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

Handling missing values of Age.
Strategies
1. Find the mean/avg of all Age and replace NaN with it.
2. Drop all the rows having missing values.
3. Set all the missing values to zero if continuous variable or some new category for categorical values.

In [49]:
#find the average of Age
df.Age.mean()

29.69911764705882

In [50]:
#fill in the NaN values with average age
avg_age = df.Age.mean()
df.Age = df.Age.fillna(value = avg_age)

In [52]:
#check after imputation,for the missing values of Age
df[df.Age.isnull()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [ ]:
df.tail()

In [59]:
#this will count how many times S,C and Q are appeared in the dataset. It excludes missing values by default.
# use dropna = false to see all the values.
df['Embarked'].value_counts(dropna = False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [58]:
df[df['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [ ]:
#check the unique values and their count in the df
df['Cabin'].value_counts(dropna = False)

In [76]:
#check when either of these columns have missing values.
df.dropna(subset = ['Embarked','Cabin'], how = 'any').shape

(202, 12)